{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "MplugOwlForConditionalGeneration",
    "parent_library": "mplug_owl.modeling_mplug_owl"
  },
  "base_model_name_or_path": "MAGAer13/mplug-owl-llama-7b-pt",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 32,
  "lora_dropout": 0.05,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": ".*language_model.*\\.(q_proj|v_proj)",
  "task_type": null
}